app/controllers/dailies_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "dailies".* FROM "dailies" WHERE "dailies"."profile_id" = 1
---
  def index
    @profile = Profile.find(params[:profile_id])
    @dailies = @profile.dailies.all

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @profile = Profile.find(params[:profile_id])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "dailies" ("calculated_at", "content", "created_at", "profile_id", "total", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["calculated_at", Sat, 12 Jan 2013], ["content", nil], ["created_at", Sat, 12 Jan 2013 13:01:14 UTC +00:00], ["profile_id", 1], ["total", 405], ["updated_at", Sat, 12 Jan 2013 13:01:14 UTC +00:00]]
---
  def create
    @profile = Profile.find(params[:profile_id])
    @daily = @profile.dailies.new(params[:daily])


    respond_to do |format|
      if @daily.save