app/controllers/users_controller.rb

  def index
    @users = User.search(params[:search])
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(params[:user])
    @profile = Profile.new(params[:profile])
    @user.profile = @profile

    respond_to do |format|
      if @user.save
---
INSERT INTO "profiles" ("birth_date", "created_at", "height", "name", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?)  [["birth_date", nil], ["created_at", Sat, 12 Jan 2013 12:58:04 UTC +00:00], ["height", nil], ["name", nil], ["updated_at", Sat, 12 Jan 2013 12:58:04 UTC +00:00], ["weight", nil]]
INSERT INTO "users" ("created_at", "email", "password", "password_confirmartion", "password_digest", "persistence_token", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)