app/views/dailies/new.html.erb

    <p>
     <%= f.collection_select(:content, Food.all, :name, :name) %>
---
SELECT "foods".* FROM "foods"