app/views/tips/index.html.erb

SELECT "tips".* FROM "tips" WHERE "tips"."id" = ? LIMIT 1  [["id", 2]]
---
<br/>
<%= link_to image_tag("greentea.jpg", :border=>0), Tip.find(1) %>